Revit 2026 API

# APIObject Properties

---

The APIObject type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsReadOnly | Identifies if the object is read-only or modifiable. |

#### Reference

APIObject Class

Autodesk.Revit.DB Namespace